app/Controllers/Ad.php

    public function delete($id)
    {
        $model= new UserModel();
        $newData=$model->where('id',$id)->first();
        $model->delete($id);




        $model->where('id',$id)->delete($id);
---
SELECT *
FROM `user`
WHERE `id` = '12'
 LIMIT 1
DELETE FROM `user`
WHERE `id` IN ('12')
DELETE FROM `user`
WHERE `id` = '12'
AND `id` IN ('12')

    public function edituser($id)
    {
        $model = new UserModel();

        if ($this->request->getMethod() === 'POST' && $this->validate(['name' => 'required']))
        {
            // Obtén los datos del formulario
            $formData = [
                'id' => $this->request->getPost('id'),
                'name' => $this->request->getPost('name'),
                'login' => $this->request->getPost('login'),
                'password' => $this->request->getPost('password'),



            ];

            // Usa el método save() para actualizar o insertar los datos
            $model->save($formData);

            // Redirige al usuario a la lista de usuarios
            return redirect()->to(base_url() . '/newad');
        }
        else
        {
            // Si no es una solicitud POST, muestra el formulario de edición
            $data['post'] = $model->find($id);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '12'