app/Models/PublicationModel.php

SELECT `publication`.*, `user`.`name`
FROM `publication`
JOIN `user` ON `user`.`id` = `publication`.`user`
ORDER BY `id` DESC
---
public function show()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('publication');
        $builder->select('publication.*, user.name');
        $builder->join('user','user.id = publication.user');
        $builder->orderBy('id','DESC');
        return $builder->get()->getResultArray();