app/Models/UserModel.php

SELECT *
FROM `user`
ORDER BY `id` DESC
---
public function showuser()
{
    $db = \Config\Database::connect();
    $builder = $db->table('user');
    $builder->select('*'); // Selecciona todas las columnas de la tabla 'user'
    $builder->orderBy('id', 'DESC'); // Ordena los resultados por 'id' en orden descendente
    return $builder->get()->getResultArray(); // Ejecuta la consulta y devuelve los resultados como un array asociativo